monster_name = {'alghoul'   : "Альгуль",
                'alp'       : "Альп",
                'arachas'   : "Главоглаз",
                'barghest'  : "Баргест",
                'basilisk'  : "Василиск",
                'botchling' : "Игоша",
                'bruxa'     : "Брукса",
                'djinn'     : "Джинн",
                'doppler'   : "Допплер",
                'drowner'   : "Утопец",
                'ekimmara'  : "Экимма",
                'endrega'   : "Эндриага",
                'fiend'     : "Бес",
                'fleder'    : "Фледер",
                'foglet'    : "Туманник",
                'forktail'  : "Вилохвост",
                'gargoyle'  : "Гаргулья",
                'ghoul'     : "Гуль",
                'godling'   : "Прибожек",
                'harpy'     : "Гарпия",
                'katakan'   : "Катакан",
                'leshen'    : "Леший",
                'nekker'    : "Накер",
                'nigthwraith': "Полуночница",
                'noonwraith': "Полуденница",
                'siren'     : "Сирена",
                'water_hag' : "Водная баба",
                'werewolf'  : "Волколак",
                'wraith'    : "Призак"
                }
monster_class = {'1' : "Проклятые",
                 '2' : "Дракониды",
                 '3' : "Элементали",
                 '4' : "Гибриды",
                 '5' : "Инсектоиды",
                 '6' : "Трупоеды",
                 '7' : "Огроиды",
                 '8' : "Реликты",
                 '9' : "Духи",
                 '10': "Вампиры"
                 }
monster_type ={'0': "Одиночка",
               '1': "Стайное",
               '2': "И то, и другое"
               }
monster_sen = {'0': "Неразумное",
               '1': "Разумное"
              }
monster_poly = {'0': "Нет",
                '1': "Да"
               }
monster_act = {'0': "Ночь",
               '1': "День",
               '2': "Не имеет значения"
              }
monster_hab = {'0': "Практически везде",
               '1': "Горы и пещеры",
               '2': "Водоемы",
               '3': "Сельская местность",
               '4': "Леса",
               '5': "Под землей",
               '6': "Кладбища, поля битв",
               '7': "Замки, руины",
               '8': "Где-то еще"
               }
monster_ab = {'0': "Нет особой",
              '1': "Исчезает и появляется",
              '2': "Становится невидимым",
              '3': "Призывает других чудовищ или зверей",
              '4': "Оглушает противника",
              '5': "Отравляет противника",
              '6': "Ослепляет противника",
              '7': "Атакует с высоты",
              '8': "Атакует силами стихий"
             }
